package com.siwuxie095.spring.cloud.chapter2nd.example6th;

/**
 * @author Jiajing Li
 * @date 2021-05-22 08:42:50
 */
public class Main {

    /**
     * 观点汇总
     *
     * 云端微服务看起来似乎简单。但要成功的话，你需要有一个综合的观点，把架构师，开发人员和 DevOps 工程师
     * 合在一起的综合视角。对亍这些观点的要点是：
     * （1）架构师：关注业务问题的自然轮廓。描述你的业务问题域，听你讲的故事。目标候选微服务将出现。记住，
     * 那就是从一个 "粗" 微服务和可重构为小的服务比从一大群小服务开始要好。微服务架构像大部分优秀的架构一
     * 样，都是突然出现而未经事先计划到分钟的（说明出现的偶然性）。
     * （2）软件工程师：事实上，服务小并不意味着良好的设计原则被抛出窗外。专注于构建分层服务，其中服务中的
     * 每一层都有独立的职责。避免在你的代码建立框架的诱惑，努力使每个微服务完全独立。过早的框架设计和采用
     * 可能会在应用程序的生命周期后期产生大量的维护成本。
     * （3）DevOps 工程师：服务不存在亍真空之中。尽早建立服务的生命周期。DevOps 的视角不仅要关注如何自动
     * 构建和部署服务，同时也关注如何监控服务的健康状况和在出错时做出反应。服务运维往往比写业务逻辑需要更多
     * 的工作和远见卓识。
     */
    public static void main(String[] args) {

    }

}
