package com.siwuxie095.spring.cloud.chapter10th.example9th;

/**
 * @author Jiajing Li
 * @date 2021-06-27 12:01:55
 */
public class Main {

    /**
     * 小结
     *
     * （1）构建和部署管道是交付微服务的关键部分。一个功能良好的构建和部署管道应该允许在几分钟内
     * 部署新功能和修复 bug。
     * （2）构建和部署管道应该是自动的，没有直接的人工交互来交付服务。这个过程的任何手动部分都代
     * 表了潜在的可变性和故障。
     * （3）构建和部署管道的自动化需要大量的脚本和配置才能正确进行。构建所需的工作量不容小觑。
     * （4）构建和部署管道应该交付一个不可变的虚拟机或容器镜像。服务器镜像一旦创建了，就不应该被
     * 修改。
     * （5）环境特定的服务器配置应该在服务器建立时作为参数传入。
     */
    public static void main(String[] args) {

    }

}
