package com.siwuxie095.spring.cloud.chapter1st.example4th;

/**
 * @author Jiajing Li
 * @date 2021-05-07 21:46:23
 */
public class Main {

    /**
     * 在这里你会学到什么
     *
     * 这里会介绍如何使用 Spring Boot 和 Spring Cloud 构建基于微服务架构的应用程序的，这些应用程序可被
     * 部署到公司内运行的私有云或 Amazon、Google 或 Pivotal 等运行的公有云上。在这里，将介绍一些实际的
     * 例子。
     * （1）微服务是什么以及构建基于微服务的应用程序的设计考虑因素。
     * （2）什么时候不应该构建基于微服务的应用程序。
     * （3）如何使用 Spring Boot 框架来构建微服务。
     * （4）支持微服务应用程序的核心运维模式，特别是基于云的应用程序。
     * （5）如何使用 Spring Cloud 来实现这些运维模式。
     * （6）如何利用所学到的知识，构建一个部署管道，将服务部署到内部管理的私有云或公有云厂商所提供的环境中。
     *
     * 学习完毕后，你将具备构建和部署基于 Spring Boot 的微服务所需的知识，明白实施微服务的关键设计决策，
     * 了解服务配置管理、服务发现、消息传递、日志记录和跟踪以及安全性等如何结合在一起，以交付一个健壮的
     * 微服务环境，最后你还会看到如何在私有云或公有云中部署微服务。
     */
    public static void main(String[] args) {

    }

}
